import img1 from '../assests/images/1.jpg'
import img2 from '../assests/images/2.jpg'
import img3 from '../assests/images/3.jpg'
import img4 from '../assests/images/4.jpg'
import img5 from '../assests/images/5.jpg'
import img6 from '../assests/images/6.jpg'
import img7 from '../assests/images/7.jpg'
import img8 from '../assests/images/8.jpg'
import imgprestige from '../assests/images/prestige.jpg'
import imgblack from '../assests/images/black.jpg'
import imgbegin from '../assests/images/begin.jpg'
import imgblack2 from '../assests/images/black2.jpg'
import imgint from '../assests/images/int.jpg'
import imgdun from '../assests/images/dun.jpg'
import imgtenet from '../assests/images/tenet.jpg'
import imgopen from '../assests/images/open.jpg'

export const filmsMocks = [
    {
        id: 0,
        title: "Престиж",
        year: "2006",
        genre: "триллер, фантастика, драма, детектив",
        starring: "Хью Джекман, Кристиан Бэйл, Майкл Кейн, Пайпер Перабо, Ребекка Холл, Скарлетт Йоханссон",
        description: "Роберт и Альфред - фокусники-иллюзионисты, которые на рубеже XIX и XX веков соперничали друг с другом в Лондоне. С годами их дружеская конкуренция на профессиональной почве перерастает в настоящую войну. Они готовы на все, чтобы выведать друг у друга секреты фантастических трюков и сорвать их исполнение. Непримиримая вражда, вспыхнувшая между ними, начинает угрожать жизни окружающих их людей…",
        imageUrl: img1,
        slogan: '"Дружба, ставшая соперничеством. Соперничество, превратившееся во вражду"',
        imageSlogan: imgprestige,
        interestingFacts: ["Фильм снят по мотивам романа Кристофера Приста «Престиж» (The Prestige, 1995).",
            "Создатель «Красоты по-американски» Сэм Мендес безумно хотел перенести роман «Престиж» на экран, но автор романа Кристофер Прист настоял на том, чтобы экранизацией занялся Нолан, настолько он был впечатлен фильмами «Преследование» и «Помни».",
            "Роль фокусника Милтона исполнил настоящий иллюзионист Рикки Джей. Помимо всего прочего, он преподавал уроки фокусов Бэйлу и Джекману."
        ],
        video: "https://www.youtube.com/watch?v=6GkV6Gz7OH0"
    },
    {
        id: 1,
        title: "Темный рыцарь",
        year: "2008",
        genre: "фантастика, боевик, триллер, криминал, драма",
        starring: "Кристиан Бэйл, Хит Леджер, Аарон Экхарт, Мэгги Джилленхол, Гари Олдман, Майкл Кейн, Морган Фриман",
        description: "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.",
        imageUrl: img2,
        slogan: '"Добро пожаловать в мир Хаоса!"',
        imageSlogan: imgblack,
        interestingFacts: ["Рабочие названия картины «Бэтмен: начало 2», «Бэтмен: Темный рыцарь».",
            "Фальшивое название проекта «Первый поцелуй Рори». Сына Кристофера Нолана зовут Рори.",
            "Мэтт Дэймон был фаворитом Кристофера Нолана на роль Харви Дента, но актер отказался. Другими рассматриваемыми кандидатурами до того как роль отошла к Аарону Экхарту, были Хью Джекман, Райан Филипп, Лив Шрайбер и Джош Лукас."
        ],
        video: "https://youtube.com/watch?v=votcOf5cYCM&list=PLCq5YtZsa-HTot1cKd_nK--8Rthl_ri_P"
    },
    {
        id: 2,
        title: "Начало",
        year: "2010",
        genre: "фантастика, боевик, триллер, драма, детектив",
        starring: "Леонардо ДиКаприо, Джозеф Гордон-Левитт, Эллиот Пейдж, Том Харди, Кэн Ватанабэ, Дилип Рао, Киллиан Мерфи",
        description: "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил.",
        imageUrl: img3,
        slogan: '"Твой разум - место преступления"',
        imageSlogan: imgbegin,
        interestingFacts: ["Джеймс Франко начал вести переговоры с Кристофером Ноланом по поводу роли в фильме. Однако из-за нестыковок в расписании актера он не смог присоединиться к актерской команде. Роль, предназначавшуюся Франко, исполнил Джозеф Гордон-Левитт.",
            "Съемки фильма начались 13 июля 2009 года.",
            "Леонардо ДиКаприо был первым актером, который дал согласие на участие в проекте."
        ],
        video: "https://www.youtube.com/watch?v=85Zz1CCXyDI&list=PLvDc9ZundpLhZQgy-IeQwnEisGX9Ij68K"
    },
    {
        id: 3,
        title: "Темный рыцарь: Возрождение легенды",
        year: "2012",
        genre: "фантастика, боевик, триллер, драма, криминал",
        starring: "Кристиан Бэйл, Том Харди, Энн Хэтэуэй, Джозеф Гордон-Левитт, Марион Котийяр, Гари Олдман, Морган Фриман",
        description: "Восемь лет назад Бэтмен растворился в ночи, превратившись из героя в беглеца. Приняв на себя вину за смерть прокурора Харви Дента, он пожертвовал всем. Вместе с комиссаром Гордоном они решили, что так будет лучше для всех. Пока преступность была раздавлена антикриминальным актом Дента, ложь действовала.",
        imageUrl: img4,
        slogan: '"И разгорится пламя"',
        imageSlogan: imgblack2,
        interestingFacts: ["Кристофер Нолан — первый постановщик, завершивший полную трилогию фильмов о Бэтмене, но второй по режиссуре трилогии лент про одного супергероя (после Сэма Рэйми с его картинами о Человеке-пауке).",
            "Кристиан Бэйл стал первым актером, сыгравшим Бэтмена / Брюса Уэйна в трех фильмах. Кевин Конрой к 2011 году сыграл эту роль в семи анимационных фильмах (включая «Бэтмен будущего: Возвращение Джокера», 2000).",
            "Оператора Уолли Пфистера заинтересовало снять фильм полностью в формате IMAX, так как и он, и Кристофер Нолан с отвращением относятся к съемкам в 3D. В итоге в фильме присутствует около 50 минут IMAX-кадров, а остальное было снято в сочетании 35 мм и 70 мм."
        ],
        video: "https://www.youtube.com/watch?v=gV2UC9NVj0M&list=PLW2ATOTnY-VMBxYUCS47NttYgfasFLVHi"
    },
    {
        id: 4,
        title: "Интерстеллар",
        year: "2014",
        genre: "фантастика, драма, приключения",
        starring: "Мэттью Макконахи, Энн Хэтэуэй, Джессика Честейн, Маккензи Фой, Майкл Кейн, Дэвид Джеси, Уэс Бентли",
        description: "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
        imageUrl: img5,
        slogan: '"Следующий шаг человечества станет величайшим"',
        imageSlogan: imgint,
        interestingFacts: ["Стивен Спилберг был прикреплен к проекту с 2006 года и нанял Джонатана Нолана писать сценарий, но отложил работу и занялся другими фильмами. В 2012, после ухода Спилберга, Джонатан Нолан предложил нанять своего брата Кристофера Нолана в качестве режиссера.",
            "Когда Спилберг ещё был прикреплен к проекту в качестве режиссёра, он собирался снимать в главной роли Уилла Смита. Позже, после ухода Спилберга с поста режиссёра, роль отошла Мэттью Макконахи.",
            "Это первый фильм Кристофера Нолана, начиная с фильма «Преследование» (1998), снятый без оператора Уолли Пфистера. Вместо Пфистера Нолан нанял оператора Хойте Ван Хойтема."
        ],
        video: "https://www.youtube.com/watch?v=4215UCaNhyI"
    },
    {
        id: 5,
        title: "Дюнкерк",
        year: "2017",
        genre: "военный, драма, история",
        starring: "Финн Уайтхед, Том Глинн-Карни, Джек Лауден, Гарри Стайлс, Анайрин Барнард, Джеймс Д’Арси, Барри Кеоган",
        description: "Фильм расскажет историю чудесного спасения более трехсот тысяч солдат в ходе Дюнкеркской операции, имевшей место в начале Второй мировой войны. События начинаются с окружения сотен тысяч британских и союзных войск силами противника. Пойманные в ловушку на пляже, и находясь спиной к морю, они сталкиваются лицом к лицу с неразрешимой ситуацией, тем временем как тиски противника сжимаются все сильнее и сильнее.",
        imageUrl: img6,
        slogan: '"Событие, которое изменило мир"',
        imageSlogan: imgdun,
        interestingFacts: ["Первый фильм Кристофера Нолана, снятый на основе исторических событий. До сих пор он снимал исключительно по оригинальным сценариям, делал ремейки и экранизации романов и комиксов.",
            "После драмы Пола Томаса Андерсона «Мастер» (2012) и вестерна Квентина Тарантино «Омерзительная восьмёрка» (2015), «Дюнкерк» — третий крупный кинематографический проект десятилетия, снятый в основном на 70 мм плёнку и демонстрированный в этом же формате.",
            "Пока съёмки проходили на искусственном пресном озере Эйсселмер в центральной части Нидерландов, актёры и съёмочная группа проживали в Урке, это посёлок и община в провинции Флеволанд."
        ],
        video: "https://www.youtube.com/watch?v=U1JrHb3UD20"
    },
    {
        id: 6,
        title: "Довод",
        year: "2020",
        genre: "фантастика, боевик, триллер",
        starring: "Джон Дэвид Вашингтон, Роберт Паттинсон, Элизабет Дебики, Кеннет Брана, Аарон Тейлор-Джонсон, Майкл Кейн, Химеш Патель",
        description: "После теракта в киевском оперном театре агент ЦРУ объединяется с британской разведкой, чтобы противостоять русскому олигарху, который сколотил состояние на торговле оружием. Для этого агенты используют инверсию времени — технологию будущего, позволяющую времени идти вспять.",
        imageUrl: img7,
        slogan: '"Время уходит"',
        imageSlogan: imgtenet,
        interestingFacts: ["В фильме есть планы и детали, которые Кристофер Нолан обдумывал около 20 лет. Написание сценария у него заняло 6 лет.",
            "Рабочее название фильма — «Карусель» ('Merry-Go-Round').",
            "В фильме всего 280 кадров с компьютерной графикой, остальное — живые съемки с применением практических спецэффектов."
        ],
        video: "https://www.youtube.com/watch?v=K5VEhk3OfBE"
    },
    {
        id: 7,
        title: "Оппенгеймер",
        year: "2023",
        genre: "биография, драма, история",
        starring: "Киллиан Мерфи, Эмили Блант, Мэтт Дэймон, Роберт Дауни мл., Флоренс Пью, Джош Хартнетт, Дэвид Крамхолц",
        description: "История жизни американского физика-теоретика Роберта Оппенгеймера, который во времена Второй мировой войны руководил Манхэттенским проектом — секретными разработками ядерного оружия.",
        imageUrl: img8,
        slogan: '"Прометей украл огонь у богов и отдал его человеку. За это он был прикован к скале и подвергнут вечным пыткам."',
        imageSlogan: imgopen,
        interestingFacts: ["Для съёмок впервые в плёночных кинокамерах IMAX была использована чёрно-белая плёнка.",
            "По словам Кристофера Нолана, мысль снять в главной роли Киллиана Мерфи пришла ему в голову, когда он рассматривал фотографию Оппенгеймера на обложке книги Кая Бёрда и Мартина Шервина «Оппенгеймер: триумф и трагедия Американского Прометея» (2005). Стараясь добиться большего сходства с прототипом, Мерфи сбросил вес и во время съёмок придерживался строгой диеты.",
            "Мэтт Дэймон сделал перерыв в актёрской карьере ради жены, правда с условием, что перерыв закончится, если вдруг с предложением у себя сняться ему позвонит Кристофер Нолан. Нолан позвонил и предложил актёру роль Лесли Гровса."
        ],
        video: "https://www.youtube.com/watch?v=S1jm3dyGNy0"
    },
]
    